app/controllers/calendar_controller.rb

  def show
    @event = Event.find(params[:event_id])
---
SELECT * FROM "events" WHERE ("events"."id" = 3)

  def edit
    @event = Event.find(params[:event_id])
---
SELECT * FROM "events" WHERE ("events"."id" = 3)