app/controllers/leagues_controller.rb

  def index
    @leagues = League.all
---
SELECT * FROM "leagues"

  def edit_league_teams
    @league = League.find(params[:league_id])
    @league_teams = @league.teams.find :all
---
SELECT * FROM "leagues" WHERE ("leagues"."id" = 12)
SELECT * FROM "teams" WHERE (sport_id = 1 AND league_id IS NULL)

  def show
    @league = League.find(params[:id])
---
SELECT * FROM "leagues" WHERE ("leagues"."id" = 1)

  def edit
    @league = League.find(params[:id])
---
SELECT * FROM "leagues" WHERE ("leagues"."id" = 2)

  def create
    starts_at = Time.parse(params[:starts_at])
    finishes_at = Time.parse(params[:finishes_at])
    @league = League.new(params[:league].merge(:rounds_played => 0, :starts_at => starts_at, :finishes_at => finishes_at))

    respond_to do |format|
      if @league.save
---
INSERT INTO "leagues" ("name", "created_at", "starts_at", "updated_at", "rounds_played", "sport_id", "finishes_at", "rounds") VALUES(0, '2010-08-27 11:01:59.120544', '2010-08-27 10:39:00.000000', '2010-08-27 11:01:59.120544', NULL, 1, '2010-12-27 10:39:00.000000', 10) RETURNING "id"

  def update
    @league = League.find(params[:id])
---
SELECT * FROM "leagues" WHERE ("leagues"."id" = 12)

  def league_team_add
    team = Team.find(params[:team_id])
    league = League.find(params[:league_id])
    team.league = league
    team.save
---
SELECT * FROM "teams" WHERE ("teams"."id" = 2)
SELECT * FROM "leagues" WHERE ("leagues"."id" = 12)
UPDATE "teams" SET "updated_at" = '2010-09-01 21:43:31.712867', "league_id" = 12 WHERE "id" = 2

  def remove_league_team
    team = Team.find(params[:team_id])
    league = team.league
    team.league = nil
    team.save
---
SELECT * FROM "teams" WHERE ("teams"."id" = 2)
UPDATE "teams" SET "updated_at" = '2010-09-01 20:50:46.126615', "league_id" = NULL WHERE "id" = 2

  def destroy
    @league = League.find(params[:id])
    @league.destroy
---
SELECT * FROM "leagues" WHERE ("leagues"."id" = 1)
DELETE FROM "leagues" WHERE "id" = 1