app/controllers/matches_controller.rb

  def index
    @matches = Match.all
---
SELECT * FROM "matches"

  def show
    @match = Match.find(params[:id])
---
SELECT * FROM "matches" WHERE ("matches"."id" = 0)