app/controllers/newzs_controller.rb

SELECT * FROM "newzs"
SELECT * FROM "sports" WHERE ("sports"."id" = 2)
---
  def index

    @newzs = params[:sport].blank? ? (Newz.find :all) : (Newz.find_all_by_sport_id params[:sport])

SELECT * FROM "newzs" WHERE ("newzs"."id" = 0)
---
  def show
    @newz = Newz.find(params[:id])

SELECT * FROM "newzs" WHERE ("newzs"."id" = 2)
---
  def edit
    redirect_to default_path unless (@current_user.admin?)
    return unless (@current_user.admin?)

    @newz = Newz.find(params[:id])

INSERT INTO "newzs" ("created_at", "updated_at", "text", "header", "sport_id") VALUES('2010-06-23 09:33:42.509594', '2010-06-23 09:33:42.509594', E'', E'', 0) RETURNING "id"
---
  def create
    @newz = Newz.new(params[:newz])

    respond_to do |format|
      if @newz.save

SELECT * FROM "newzs" WHERE ("newzs"."id" = 2)
UPDATE "newzs" SET "updated_at" = '2010-08-27 10:22:15.397832', "text" = E'nejake normalne slova ] as
---
  def update
    @newz = Newz.find(params[:id])

    respond_to do |format|
      if @newz.update_attributes(params[:newz])

SELECT * FROM "newzs" WHERE ("newzs"."id" = 1)
DELETE FROM "newzs" WHERE "id" = 1
---
  def destroy
    @newz = Newz.find(params[:id])
    @newz.destroy