app/controllers/scores_controller.rb

  def index
    @scores = Newz.all
---
SELECT * FROM "newzs"