app/controllers/teams_controller.rb

  def index
    @teams = Team.all
    @selected_sport_name = (Sport.find params[:sport]).name if params[:sport]
---
SELECT * FROM "teams"
SELECT * FROM "sports" WHERE ("sports"."id" = 7)

  def suggest
	    @token = params[:name].ascii
	    @teams = Team.find :all, :conditions => ["' ' || ascii_name like ?", "% #{@token}%"], :order => 'name', :limit => 20
---
SELECT * FROM "teams" WHERE (' ' || ascii_name like E'% a%') ORDER BY name LIMIT 20

  def show
    @team = Team.find(params[:id])
---
SELECT * FROM "teams" WHERE ("teams"."id" = 0)

  def edit
    @team = Team.find(params[:id])
---
SELECT * FROM "teams" WHERE ("teams"."id" = 1)

  def create
    @team = Team.new(params[:team])
    @team.sport_id = @selected_sport
    @team.user_id = @current_user.id
    @current_user.sports << @team.sport
---
INSERT INTO "sports" ("name", "created_at", "parts", "updated_at", "team") VALUES(E'soccer', '2010-08-24 17:11:04.476900', 2, '2010-08-24 17:11:04.476900', 't') RETURNING "id"
INSERT INTO "teams" ("name", "league_id", "created_at", "max_players", "updated_at", "logo", "ascii_name", "sport_id") VALUES(E'sadsa', NULL, '2010-07-30 09:58:10.081212', NULL, '2010-07-30 09:58:10.081212', NULL, NULL, 1) RETURNING "id"
INSERT INTO "users" ("salt", "user_role", "created_at", "updated_at", "reg_date", "gender", "digest", "foto", "last_name", "first_name", "email") VALUES(E'203be43537b30e78aff59d295d543437d8fe9abf', NULL, '2010-08-24 17:11:04.423714', '2010-08-24 17:11:04.423714', NULL, NULL, E'526331d38a7fa0c3bd5e8d37bef5524b74e1cf3d', NULL, NULL, E'dusan', E'dusan@trt.sk') RETURNING "id"

  def update
    @team = Team.find(params[:id])
    respond_to do |format|
      if @team.update_attributes(params[:team])
---
SELECT * FROM "teams" WHERE ("teams"."id" = 1)
UPDATE "teams" SET "updated_at" = '2010-08-27 10:23:58.134601', "logo" = E'', "max_players" = 15 WHERE "id" = 1

  def destroy
    @team = Team.find(params[:id])
    @team.destroy
---
SELECT * FROM "teams" WHERE ("teams"."id" = 1)
DELETE FROM "teams" WHERE "id" = 1