app/controllers/users_controller.rb

SELECT * FROM "sports" WHERE ("sports"."id" = 7)
---
  def index
   sport = Sport.find  @selected_sport

SELECT * FROM "users" WHERE ("users"."id" = 1)
UPDATE "users" SET "updated_at" = '2010-07-18 13:06:52.526087', "salt" = E'c45d04797841518f64605322fb9af91173a7fc36', "user_role" = E'', "digest" = E'0ce6575fbb680e7e02fef2217a2d5180bb592169', "foto" = E'', "last_name" = E'kokot', "reg_date" = '2010-07-18 13:01:00.000000', "gender" = E'' WHERE "id" = 1
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])